<template lang="pug">
    #how-to-become-a-developer
        HeaderComponent
        section.section__article-page
            div.container.article-page__container
                h2.h2.h2--secondary.h2--article Нow to become a developer
                h2.h2.h2--primary.h2__article-page--primary.h2--article Как стать разработчиком
                h3.article-page__h3 Как стать разработчиком?
                p.article-page__text Часто приходится слышать, что разработчиками не становятся - разработчиками рождаются. Многие видят в IT перспективную область с высокой зарплатой и возможностью работать из любой точки земного шара, но при этом думают, что разрабатывать приложения это удел лишь небольшого процента одарённых людей. Здесь я постараюсь на примерах реальных людей показать, что стать разработчиком можно вне зависимости от образования, прошлого опыта, возраста и пола.
                h3.article-page__h3 Немного мотивирующих историй
                p Начну с истории молодого человека, который, отучившись в институте на сварщика, по окончании ВУЗа пошел работать по специальности на один из заводов Москвы, построенный еще в Советском Союзе. Очень интересно было его слушать, когда он рассказывал про вечно нетрезвых работников, учивших его уже за обедом принимать 100 грамм; про особенный диалект русского языка, состоявший исключительно из матерных слов; про то, как можно жить на 4000 рублей в неделю… Но спустя четыре года он понял, что нужно что-то менять и пошел с вопросами к тому, кто знает всё:
                blockquote.blockquote-style - Окей, гугл, у кого сейчас хорошая зарплата? <br>- У разработчиков.<br>- Окей, гугл, как стать разработчиком?
                p.article-page__text--margin-bottom После этого диалога он заказал себе десять книжек на тему Java разработки, которые изучил за полгода, после чего в 2018 году пришел работать в мою команду на оклад 100к. А еще через три месяца его позвал к себе Яндекс.
                p.article-page__text--margin-bottom Другой мой знакомый уже в школе понял, что IT - это то, чем ему хочется заниматься. Он с трудом получил среднее образование, полгода проучился в институте, после чего в свой девятнадцатый день рождения пришел в мою команду Angular разработчиком, заслуженно попросив оклад 250к. На мой вопрос, как он смог получить такие знания и опыт, он ответил, что еще три года назад понял, куда перспективно двигаться и что для этого нужно учить. Вместо книжек по биологии и истории он читал Грокаем Алгоритмы и Чистый код Мартина. И вот результат.
                p.article-page__text.article-page__text--margin-bottom Ещё есть история про разработчика-студента, который жил с мамой. Он целые дни проводил за компьютером, печатая на черном экране непонятные слова. А мама была очень бдительной и беспокоилась, что её сын занимается чем-то незаконным. Она начала задавать вопросы, чем занимается её сын, что означают эти слова, для чего это нужно и какой смысл во всём написанном. Через пару месяцев она смогла выполнять простые задачи на Java, помогая сыну в его проектах, при этом прибавка к пенсии в размере 20к была совсем не лишней.
                h3.article-page__h3 С чего начать и куда двигаться?
                p.article-page__text Итак, есть несколько основных вариантов движения в области IT: web разработка, мобильная разработка, разработка игр и графики, 1С, системное программирование, devOps, искусственный интеллект и машинное обучение, а также дизайн, тестирование и аналитика. Средние зарплаты по каждому направлению можно посмотреть в интернете.
                h3.article-page__h3 Что выбрать?
                p Наверное, самый легкий заход - во фронтовую часть web разработки: HTML and CSS даже пятиклассники осваивают; с другой стороны бэкенд разработчик Java - одна из самых популярных вакансий. В мобильной разработке самый высокий уровень зарплат, но туда и высокий порог входа.
                p Игры и графика где-то рядом находятся плюс пригодятся математика, машинная графика и черчение. Системное программирование - это программирование на низком уровне, например, микроконтроллеров - С++, ассемблер и прочее...
                p.article-page__text DevOps - тема системного администрирования и настройки серверов под нужды разработки.
                h3.article-page__h3 Какие фундаментальные знания потребуются?
                p.article-page__text--margin-bottom Конечно же, это математика и информатика. Высшее техническое образование (даже не обязательно профильное) повысит шансы на успех. Если его нет - можно начать со школьных учебников информатики.
                p Цель любого сегодняшнего айтишника - научиться самостоятельно учиться: определять, что сейчас в тренде, ставить себе цели на развитие, понимать, что тебе нужно сейчас, а что не нужно, знать, где можно найти и какую инфу. IT сфера постоянно развивается, нельзя что-то один раз выучить, а потом на этом долго и счастливо ехать. Процесс черпания знаний должен быть постоянным и доставлять удовольствие.
                blockquote.blockquote-style “Нужно бежать со всех ног, чтобы только оставаться на месте, а чтобы куда-то попасть, надо бежать как минимум вдвое быстрее!”
                p Однако техническое направление не является бесконечным и рано или поздно целеустремленные разработчики начинают погружаться в смежные с IT области, изучая, например, маркетинг, продажи, банковское дело и подбора персонала…
                p.article-page__text--margin Для начала можно пойти учиться в институт, можно на платные курсы. Также в интернете полно и бесплатной информации (лекции, книги, форумы, самоучители…) и лучше начинать именно с этого варианта. Он подойдёт людям, которые могут справиться с собственной ленью, а ежедневный просмотр сериальчиков заменить на удивительное погружение в сказочный мир IT разработки.

                FooterComponent
</template>

<script>

import HeaderComponent from "../../components/HeaderComponent";
import FooterComponent from "../../components/FooterComponent";

export default {
  name: 'how-to-become-a-developer',
  components: {
      FooterComponent,
      HeaderComponent
  },
    data() {
        return {
        }
    },
}
</script>

<style lang="scss">
    @import "../../assets/scss/general.scss";

    .section__article-page {
        background: url("../../assets/triangular-bg-desktop.png") center repeat-y;
        background-size: contain;
    }

    .article-page__container {
        display: grid;
        grid-template-rows: repeat(2, auto);
        padding: 50px 140px 0;
        background: transparent url("../../assets/about-header-bg-desktop.png") no-repeat top right;
        background-size: 30%;

        p {
            font-size: 18px;
        }
    }

    .article-page__text--margin {
        margin-bottom: 100px;
    }

    .h2__article-page--primary {
        margin-bottom: 100px;
    }

    .article-page__content {
        font-size: 20px;
        margin-bottom: 70px;
    }

    .article-page__technologies-list {
        display: flex;
        flex-wrap: wrap;
        justify-content: center;
        margin-bottom: 300px;
    }

    .article-page__h3 {
        font-weight: bold;
        font-size: 20px;
        margin-bottom: 30px;
    }

    .article-page__text {
        margin-bottom: 40px;
    }

    .blockquote-style {
        position: relative;
        width: fit-content;
        padding: 40px 100px;
        font-style: italic;
        font-weight: 600;

        &:before {
            content: '';
            position: absolute;
            background: transparent url("../../assets/cite-before.svg") no-repeat center;
            background-size: contain;
            width: 50px;
            height: 50px;
            top: 0;
            left: 45px;
        }

        &:after {
            content: '';
            position: absolute;
            background: transparent url("../../assets/cite-after.svg") no-repeat center;
            background-size: contain;
            width: 50px;
            height: 50px;
            bottom: 0;
            right: 60px;

        }
    }

    .article-page__text--margin-bottom {
        margin-bottom: 30px;
    }

    @media (max-width: 900px) {

        .article-page__container {
            background-size: 350px;
            background-position: top center;
        }

        .article-page__container {
            padding: 130px 20px 0;
        }

        .h2__article-page--primary {
            margin-bottom: 50px;
        }

        .h2--article {
            line-height: 30px;
        }

        .article-page__technologies-list {
            margin-bottom: 50px;
        }

    }




</style>
